# Loading data

In [1]:
import pandas as pd
stock_price = pd.read_csv('stock_price.csv')

In [2]:
companies = pd.read_csv("companiesname.csv")

In [3]:
companies.head()

  symbol                 name
0    MMM                   3M
1    AOS          A. O. Smith
2    ABT  Abbott Laboratories
3   ABBV               AbbVie
4   ABMD              Abiomed

In [4]:
stock_price = round(stock_price, 2)
stock_price = stock_price[['Symbol','Date','Open','High','Low','Close','Volume']]

In [5]:
stock_price = pd.DataFrame(stock_price)
stock_price.head()

  Symbol        Date    Open    High     Low   Close     Volume
0    MMM  2022-03-21  148.69  149.74  147.40  148.58  4514900.0
1    MMM  2022-03-22  149.45  150.84  148.50  149.94  4252000.0
2    MMM  2022-03-23  149.69  149.78  147.56  147.68  2637200.0
3    MMM  2022-03-24  148.12  149.23  147.40  148.98  2028100.0
4    MMM  2022-03-25  149.27  151.18  148.91  150.46  2247800.0

# Postgresql

In [6]:
from sqlalchemy import create_engine
conn_url = 'postgresql://postgres:pwd4APAN5400@localhost/5400 Project'
engine = create_engine(conn_url)
connection = engine.connect()

In [7]:
createCmd1 = """ DROP TABLE IF EXISTS stock_price CASCADE;

                CREATE TABLE stock_price (
                 symbol   VARCHAR(10),
                 Date     Date,
                 Open     NUMERIC(10, 2),
                 High     NUMERIC(10, 2),
                 Low      NUMERIC(10, 2),
                 Close    NUMERIC(10, 2),
                 Volume   NUMERIC(15, 2),
                 PRIMARY KEY (Symbol, Date)
                 );
             """
connection.execute(createCmd1)

In [8]:
createCmd2 = """ DROP TABLE IF EXISTS company CASCADE;

                CREATE TABLE company (
                 Symbol   VARCHAR(10),
                 Company_name   VARCHAR(50)
                 );
             """
connection.execute(createCmd2)

In [9]:
companies.rename(columns={'name': 'Company_name'},inplace=True)
companies.columns=companies.columns.str.lower()
companies.head()

  symbol         company_name
0    MMM                   3M
1    AOS          A. O. Smith
2    ABT  Abbott Laboratories
3   ABBV               AbbVie
4   ABMD              Abiomed

In [10]:
stock_price['Date'] = pd.to_datetime(stock_price['Date'], format = '%Y-%m-%d')
stock_price.columns=stock_price.columns.str.lower()
stock_price.head()

  symbol       date    open    high     low   close     volume
0    MMM 2022-03-21  148.69  149.74  147.40  148.58  4514900.0
1    MMM 2022-03-22  149.45  150.84  148.50  149.94  4252000.0
2    MMM 2022-03-23  149.69  149.78  147.56  147.68  2637200.0
3    MMM 2022-03-24  148.12  149.23  147.40  148.98  2028100.0
4    MMM 2022-03-25  149.27  151.18  148.91  150.46  2247800.0

In [11]:
stock_price.to_sql('stock_price', con = engine, if_exists = 'append', index = False)

In [12]:
companies.to_sql('company', con = engine, if_exists = 'append', index = False)

In [13]:
#TEST
query1 = "SELECT * FROM stock_price"
result = connection.execute (query1)
row = result.fetchall()
stockprice = pd.DataFrame(row, columns =['symbol', 'date','open','high','low','close','volume'])
stockprice[:10]

  symbol        date    open    high     low   close      volume
0    MMM  2022-03-21  148.69  149.74  147.40  148.58  4514900.00
1    MMM  2022-03-22  149.45  150.84  148.50  149.94  4252000.00
2    MMM  2022-03-23  149.69  149.78  147.56  147.68  2637200.00
3    MMM  2022-03-24  148.12  149.23  147.40  148.98  2028100.00
4    MMM  2022-03-25  149.27  151.18  148.91  150.46  2247800.00
5    MMM  2022-03-28  149.93  150.13  147.19  149.47  2679900.00
6    MMM  2022-03-29  151.00  152.92  150.04  152.08  2693200.00
7    MMM  2022-03-30  151.33  153.26  150.77  151.43  2395100.00
8    MMM  2022-03-31  150.45  151.25  148.80  148.88  3193800.00
9    MMM  2022-04-01  149.63  149.86  146.85  149.69  2196400.00

In [14]:
#TEST
query1 = "SELECT * FROM company"
result = connection.execute (query1)
row1 = result.fetchall()
row1[:10]

[('MMM', '3M'),
 ('AOS', 'A. O. Smith'),
 ('ABT', 'Abbott Laboratories'),
 ('ABBV', 'AbbVie'),
 ('ABMD', 'Abiomed'),
 ('ACN', 'Accenture'),
 ('ATVI', 'Activision Blizzard'),
 ('ADM', 'ADM'),
 ('ADBE', 'Adobe'),
 ('AAP', 'Advance Auto Parts')]

In [15]:
#Get company list
query = """ SELECT company_name FROM company
            """
results = connection.execute(query)
row = results.fetchall()
company_df = pd.DataFrame(row, columns =['company_name'])
company_df.head()

          company_name
0                   3M
1          A. O. Smith
2  Abbott Laboratories
3               AbbVie
4              Abiomed

In [16]:
#Get company symbol list
query = """ SELECT symbol FROM company
            """
results = connection.execute(query)
row = results.fetchall()
symbol_df = pd.DataFrame(row, columns =['symbol'])
symbol_df.head()

  symbol
0    MMM
1    AOS
2    ABT
3   ABBV
4   ABMD

In [17]:
company_list = list(company_df["company_name"])
symbol_list = list(symbol_df["symbol"])

In [18]:
company_list[:10]

['3M',
 'A. O. Smith',
 'Abbott Laboratories',
 'AbbVie',
 'Abiomed',
 'Accenture',
 'Activision Blizzard',
 'ADM',
 'Adobe',
 'Advance Auto Parts']

In [19]:
symbol_list[:10]

['MMM', 'AOS', 'ABT', 'ABBV', 'ABMD', 'ACN', 'ATVI', 'ADM', 'ADBE', 'AAP']

In [20]:
#join two tables
query = """ SELECT * 
            FROM stock_price s
            LEFT JOIN company c ON s.symbol = c.symbol
            """
results = connection.execute(query)
row = results.fetchall()

In [21]:
stockprice = pd.DataFrame(row, columns =['symbol','date','open','high','low','close','volume', 'symbol1', 'company_name'])
stockprice.head()

,symbol,date,open,high,low,close,volume,symbol1,company_name
0,MMM,2022-03-21,148.69,149.74,147.40,148.58,4514900.00,MMM,3M
1,MMM,2022-03-22,149.45,150.84,148.50,149.94,4252000.00,MMM,3M
2,MMM,2022-03-23,149.69,149.78,147.56,147.68,2637200.00,MMM,3M
3,MMM,2022-03-24,148.12,149.23,147.40,148.98,2028100.00,MMM,3M
4,MMM,2022-03-25,149.27,151.18,148.91,150.46,2247800.00,MMM,3M

In [22]:
stockprice = stockprice[['symbol','date','open','high','low','close','volume','company_name']]
stockprice.head()

  symbol        date    open    high     low   close      volume company_name
0    MMM  2022-03-21  148.69  149.74  147.40  148.58  4514900.00           3M
1    MMM  2022-03-22  149.45  150.84  148.50  149.94  4252000.00           3M
2    MMM  2022-03-23  149.69  149.78  147.56  147.68  2637200.00           3M
3    MMM  2022-03-24  148.12  149.23  147.40  148.98  2028100.00           3M
4    MMM  2022-03-25  149.27  151.18  148.91  150.46  2247800.00           3M

In [23]:
#in order to further apply elasticsearch, I export the result data from Postgresql.
stockprice.to_csv('stockprice.csv',index=False)

In [24]:
import pandas as pd
stockprice = pd.read_csv('stockprice.csv')
stockprice.head()

  symbol        date    open    high     low   close     volume company_name
0    MMM  2022-03-21  148.69  149.74  147.40  148.58  4514900.0           3M
1    MMM  2022-03-22  149.45  150.84  148.50  149.94  4252000.0           3M
2    MMM  2022-03-23  149.69  149.78  147.56  147.68  2637200.0           3M
3    MMM  2022-03-24  148.12  149.23  147.40  148.98  2028100.0           3M
4    MMM  2022-03-25  149.27  151.18  148.91  150.46  2247800.0           3M

# Elasticsearch

In [25]:
import json
with open('news.json') as f:
    news = json.load(f)
print(len(news))

9950

In [26]:
from elasticsearch import Elasticsearch
from elasticsearch_dsl import connections
from elasticsearch.helpers import bulk
from elasticsearch_dsl import Search
from elasticsearch_dsl import Q
from pprint import pprint
from datetime import datetime

In [30]:
client = Elasticsearch(hosts=["localhost"],
                     port=9200, 
                     http_auth=('elastic', '123456'), 
                     ca_certs='http_ca.crt',
                     use_ssl=True, 
                     verify_certs=True)

In [ ]:
from elasticsearch.helpers import bulk
resp = bulk(client, news, index = 'news')

In [ ]:
import csv
with open('stockprice.csv') as f:
    reader = csv.DictReader(f)
    resp1 = bulk(client, reader, index='stockprice')

In [ ]:
s = Search(using=client, index="news") \
        .query("match", company="Apple") \
        .sort({'publishedAt': {'order': 'asc'}})

el_response = s.execute() # by default you get 10 hits

for hit in el_response['hits']['hits']:
    pprint(hit['_source'].to_dict())

# Flask

In [ ]:
from flask import Flask, render_template, request, g
import time
from doctest import debug
from datetime import date
import matplotlib.pyplot as plt
import io
import base64
from matplotlib.backends.backend_agg import FigureCanvasAgg as FigureCanvas

In [ ]:
app = Flask(__name__)
es = client

@app.route("/", methods=['GET'])
def index():
    return render_template('index.html')


@app.route('/search/', methods=['POST'])
def search_stock():
    if request.method == 'POST':
        data = request.form.to_dict(flat=False)
        print(data)
        company = None if data['company'][0] == '' else data['company'][0]
        start_date = None if data['start_date'][0] == '' else data['start_date'][0]
        end_date = None if data['end_date'][0] == '' else data['end_date'][0]
        print(company)
        
        conditions = {}
        conditions1 = {}
        query = []
        query1 = []
        
        if company is not None:
            if (company in company_list):
                query.append({"match" : {"company" : company}})
            elif (company in symbol_list):
                query.append({"match" : {"symbol" : company}})
            else:
                print("No data found")
        if start_date is not None:
            query.append({"range": {"publishedAt": {"gte": start_date}}})
        if end_date is not None:
            query.append({"range": {"publishedAt": {"lte": end_date}}})
        conditions['sort'] = {"publishedAt": {"order": "desc"}}
        conditions['query'] = {"bool":{
                                    "must": query
                                }
                              }
        if company is not None:
            if (company in company_list):
                query1.append({"match" : {"company_name" : company}})
            elif (company in symbol_list):
                query1.append({"match" : {"symbol" : company}})
            else:
                print("No data found")
        if start_date is not None:
            query1.append({"range": {"date": {"gte": start_date}}})
        if end_date is not None:
            query1.append({"range": {"date": {"lte": end_date}}})
        conditions1['sort'] = {"date": {"order": "asc"}}
        conditions1['query'] = {"bool":{
                                    "must": query1
        }}
        
        res_news =  es.search(index = "news",
                        body = conditions)
        result = [entry['_source'] for entry in res_news['hits']['hits']]
        
        res_stockprice =  es.search(index = "stockprice",
                        body = conditions1)
        result1 = [entry['_source'] for entry in res_stockprice['hits']['hits']]
        
        column_names = result[0].keys() if len(result) > 0 else []
        column_names1 = result1[0].keys() if len(result1) > 0 else []
        
        today = date.today()
        
        xAxis = [i["date"] for i in result1]
        yAxis = [float(i["close"]) for i in result1]
        yAxis1 = [float(i["volume"]) for i in result1]

        # Create figure and axis #1
        fig, ax1 = plt.subplots()
        # plot line chart on axis #1
        ax1.plot(xAxis,yAxis,marker="o") 
        ax1.set_ylabel('Close Price')
        ax1.set_ylim(min(yAxis)-2, max(yAxis)+2)
        ax1.legend(['Close Price($)'], loc="upper left")
        ax1.set_xlabel('Date')
        ax1.set_xticklabels(ax1.get_xticks(), rotation = 15)
        # set up the 2nd axis
        ax2 = ax1.twinx()
        # plot bar chart on axis #2
        ax2.bar(xAxis,yAxis1, width=0.5, alpha=0.5, color='orange')
        ax2.grid(False) # turn off grid #2
        ax2.set_ylabel('Volume')
        digit = len(str(max(yAxis1))) - 3
        ax2.set_ylim(0, max(yAxis1)+10**digit)
        ax2.legend(['Volume'], loc="upper right")
        
        # Convert plot to PNG image
        pngImage = io.BytesIO()
        FigureCanvas(fig).print_png(pngImage)
    
        # Encode PNG image to base64 string
        pngImageB64String = "data:image/png;base64,"
        pngImageB64String += base64.b64encode(pngImage.getvalue()).decode('utf8')
        plt.close()
    


        return render_template('result.html', company = company, result=result, column_names = column_names,
                              result1 = result1, column_names1 = column_names1,
                              update_date=today, image=pngImageB64String)
    
if __name__ == '__main__':
    app.run(host='localhost', port=54500)

In [ ]:
#Display elapsed time
import time
from flask import Flask, request, render_template, g
app = Flask(__name__)

@app.before_request
def before_request():
    g.request_start_time = time.time()
    g.request_time = lambda: "%.5fs" % (time.time() - g.request_start_time)
 
 
@app.route("/")
def main():
    return render_template('main.html')

if __name__ == '__main__':
    app.run(host='localhost', port=54600)

In [ ]:
#client.indices.delete(index='news', ignore=[400, 404])
#client.indices.delete(index='stockprice', ignore=[400, 404])

# Testing

In [ ]:
condition = {"sort":{"publishedAt": {"order": "desc"}}, 
             "query":{
                 "bool":{
                     "must": {"match" : {"company" : "Apple"}},
                     "filter": [
                         {"range": {"publishedAt": {"gte": "2022-03-24"}}},
                         {"range": {"publishedAt": {"lte": "2022-04-13"}}}
                     ]
                 }
             }
            }
res_news = client.search(index = "news",
                        body = condition)
result = [entry['_source'] for entry in res_news['hits']['hits']]
result

In [ ]:
res_stockprice =  client.search(index = "stockprice",
                        body = {
                           "sort":{"date": {"order": "desc"}},
                            "query":{
                                "bool":{
                                    "must":[                                                                                
                                        {"match" : {"company_name" : "Apple"}},
                                        {"match" : {"symbol" : "AAPL"}},
                                        {"range": {"date": {"gte": '2022-03-25'}}},
                                        {"range": {"date": {"lte": '2022-04-01'}}}
                                    ]
                                }
                            }
                        })
result = [entry['_source'] for entry in res_stockprice['hits']['hits']]
result

In [ ]:
import matplotlib.pyplot as plt

xAxis = [i["date"] for i in result]
yAxis = [float(i["close"]) for i in result]
yAxis1 = [float(i["volume"]) for i in result]

# Create figure and axis #1
fig, ax1 = plt.subplots()
# plot line chart on axis #1
ax1.plot(xAxis,yAxis) 
ax1.set_ylabel('close')
ax1.set_ylim(min(yAxis)-2, max(yAxis)+2)
ax1.legend(['Close Price($)'], loc="upper left")
ax1.set_xlabel('Date')
# set up the 2nd axis
ax2 = ax1.twinx()
# plot bar chart on axis #2
ax2.bar(xAxis,yAxis1, width=0.5, alpha=0.5, color='orange')
ax2.grid(False) # turn off grid #2
ax2.set_ylabel('Volume')
ax2.set_ylim(0, max(yAxis1)+10000000)
ax2.legend(['Volume'], loc="upper right")